Revit 2026 API

# ColorFillSchemeEntrySetStringValue Method

---

Sets new String value of entry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetStringValue(
	string value
)
```
```vb
Public Sub SetStringValue (
	value As String
)
```
```cpp
public:
void SetStringValue(
	String^ value
)
```
```fsharp
member SetStringValue :
        value : string -> unit
```

#### Parameters

value String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The entry has different storage type with String, or the value is empty, or contains forbidden characters. |

This method should only be used if the StorageType property reports the type of the entry as a String. New value should be not empty and valid for Revit name.

#### Reference

ColorFillSchemeEntry Class

Autodesk.Revit.DB Namespace